{
  "backend/main.mo": "Main Motoko canister defining data types, authorization mixin, persistent maps, and CRUD-style query/update functions for profiles, NNS data, finances, bets, tasks, habits, and lightweight plans.",
  "backend/migration.mo": "Migration module converting old plannings into new lightweight plans and producing a NewActor state with updated plan data.",
  "feature_evidence.json": "Feature evidence report linking PlanningTab redesign and React Query updates to specific frontend files and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing component roles, styling, and behaviors across the app.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables and base styles supporting light/dark modes and consistent UI surfaces.",
  "frontend/index.html": "PWA-optimized HTML entry point with iOS-specific meta tags and the root mount for the React app.",
  "frontend/src/App.tsx": "Root component managing authentication, profile loading, theme provider setup, and rendering the dashboard or login flow.",
  "frontend/src/components/DashboardLayout.tsx": "Main dashboard layout with sidebar navigation, theme toggle, logout, and dynamic tab rendering including the planning tab.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving user name and optional email using a profile mutation with toast feedback.",
  "frontend/src/components/tabs/FinancesTab.tsx": "Tab for listing bills and managing add, edit, and payment actions with dialog forms and summary data.",
  "frontend/src/components/tabs/HabitTrackerTab.tsx": "Tab to view habits, add new habits, and increment progress with toast notifications.",
  "frontend/src/components/tabs/HorseBetsTab.tsx": "Tab displaying horse bets and stats with a dialog to add new bets including amount, odds, and win status.",
  "frontend/src/components/tabs/NNSProgressTab.tsx": "Tab showing NNS staked ICP and maturity data with dialogs to update state and maturity values.",
  "frontend/src/components/tabs/PlanningTab.tsx": "Tab for creating, selecting, editing, and deleting plans with support for notes and external links.",
  "frontend/src/components/tabs/TodoListTab.tsx": "Renders a task list with dialogs for adding tasks and actions for completing them using query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, NNS data, bills, tasks, and other backend entities.",
  "frontend/src/index.css": "Tailwind base styles with light/dark theme CSS variables and global layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen with a button to authenticate via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current state, features, issues, and architectural notes for ongoing planning work."
}